package org.openyu.mix.core.service;

import org.openyu.socklet.message.vo.ModuleType;

/**
 * 1?????=系統用
 * 
 * 2?????=子功能用
 */
public enum CoreModuleType implements ModuleType {
	// ---------------------------------------------------
	// reservation 100-109=10
	// ---------------------------------------------------

	// ---------------------------------------------------
	// spec module 110-119=10
	// ---------------------------------------------------
	/**
	 * 帳戶account
	 */
	ACCOUNT(110000),

	/**
	 * 登陸login
	 */
	LOGIN(111000),

	// ---------------------------------------------------
	// master 120-149=30
	// ---------------------------------------------------
	/**
	 * 社團,盟,公會master
	 */
	LEAGUE(120000),

	/**
	 * 博物館(排行統計)master
	 */
	MUSEUM(121000),

	// ---------------------------------------------------
	// slave 150-198=49
	// ---------------------------------------------------
	/**
	 * 核心slave
	 */
	CORE(150000),

	/**
	 * 角色(等級,金幣,經驗...)slave
	 */
	ROLE(151000),

	/**
	 * 聊天slave
	 */
	CHAT(152000),

	/**
	 * 郵件slave
	 */
	MAIL(153000),

	/**
	 * 世界(玩家進入,放怪...)
	 */
	WORLD(154000),

	/**
	 * 組隊slave
	 */
	TEAM(155000),

	/**
	 * 任務slave
	 */
	QUEST(156000),

	/**
	 * 活動slave
	 */
	ACTIVITY(157000),

	/**
	 * 成就slave
	 */
	EFFORT(158000),

	/**
	 * 道具slave,(物品,種子,土地,材料,防具,武器)
	 */
	ITEM(159000),

	/**
	 * 商店slave
	 */
	SHOP(160000),

	// ---------------------------------------------------
	/**
	 * 客戶端用
	 */
	CLIENT(190000),
	
	/**
	 * 系統用
	 */
	SYSTEM(191000),

	// ---------------------------------------------------
	// 子功能開發
	// ---------------------------------------------------
	// 200-209保留
	// ---------------------------------------------------

	/**
	 * 四象slave
	 */
	SASANG(210000),

	/**
	 * 卜卦slave
	 */
	DIVINE(211000),

	/**
	 * slave
	 */
	UNKNOWN(212000),

	/**
	 * 莊園slave
	 */
	MANOR(213000),

	/**
	 * 祕寶slave
	 */
	TREASURE(214000),

	/**
	 * 訓練slave
	 */
	TRAIN(215000),

	/**
	 * 五行slave
	 */
	WUXING(216000),

	// ---------------------------------------------------
	;

	private final int value;

	private CoreModuleType(int value) {
		this.value = value;
	}

	public int getValue() {
		return value;
	}
}
